Учет_работы/src/Reports/ДеньгиПредварительно/ДеньгиПредварительно.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДеньгиПредварительно</name>
</mdclass:Report>

Учет_работы/src/AccumulationRegisters/ПредварительныйОборот/ПредварительныйОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПредварительныйОборот</name>
  <resources>
    <name>ПредварительнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Работы</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_работы/src/Reports/ДеньгиПредварительно/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	Об = РеквизитФормыВЗначение("Отчет");
	Макет = Об.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаН = Формат(ЗаПериод.ДатаНачала,"ДЛФ=Д");
	ОбластьШапка.Параметры.ДатаК = Формат(ЗаПериод.ДатаОкончания,"ДЛФ=Д");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьГод = Макет.ПолучитьОбласть("ПериодГод");
	ОбластьМесяц = Макет.ПолучитьОбласть("ПериодМесяц");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ТабДок.Очистить();
	
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГОД(ДенежныйОборот.Период) КАК ПериодГод,
	|	НАЧАЛОПЕРИОДА(ДенежныйОборот.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	ДенежныйОборот.Период КАК Период,
	|	ДенежныйОборот.Регистратор КАК Регистратор,
	|	ДенежныйОборот.НомерСтроки КАК НомерСтроки,
	|	ДенежныйОборот.Активность КАК Активность,
	|	ДенежныйОборот.ВидДвижения КАК ВидДвижения,
	|	ДенежныйОборот.Работы КАК Работы,
	|	ДенежныйОборот.Заказчик КАК Заказчик,
	|	ДенежныйОборот.ПредварительнаяСумма КАК ОплаченнаяСумма,
	|	ДенежныйОборот.МоментВремени КАК МоментВремени,
	|	МЕСЯЦ(ДенежныйОборот.Период) КАК МесяцГода,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 1
	|			ТОГДА ""Январь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 2
	|			ТОГДА ""Февраль""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 3
	|			ТОГДА ""Март""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 4
	|			ТОГДА ""Апрель""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 5
	|			ТОГДА ""Май""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 6
	|			ТОГДА ""Июнь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 7
	|			ТОГДА ""Июль""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 8
	|			ТОГДА ""Август""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 9
	|			ТОГДА ""Сентябрь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 10
	|			ТОГДА ""Октябрь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 11
	|			ТОГДА ""Ноябрь""
	|		КОГДА МЕСЯЦ(ДенежныйОборот.Период) = 12
	|			ТОГДА ""Декабрь""
	|	КОНЕЦ КАК МесяцПрописью
	|ИЗ
	|	РегистрНакопления.ПредварительныйОборот КАК ДенежныйОборот
	|ГДЕ
	|	ДенежныйОборот.Активность
	|"+?(Не ЗначениеЗаполнено(ЗаПериод),"","И ДенежныйОборот.Период МЕЖДУ &ДатаН И &ДатаК")+"
	|"+?(Не ЗначениеЗаполнено(Заказчик),"","И ДенежныйОборот.Заказчик = &Заказчик")+"
	|"+?(Не ЗначениеЗаполнено(Работа),"","И ДенежныйОборот.Работы = &Работа")+"
	
	|ИТОГИ
	|	СУММА(ОплаченнаяСумма)
	|ПО
	|	ПериодГод,
	|	МесяцПрописью"; 
	
	Запрос.УстановитьПараметр("ДатаН",ЗаПериод.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаК",ЗаПериод.ДатаОкончания);
	Запрос.УстановитьПараметр("Заказчик",Заказчик);
	Запрос.УстановитьПараметр("Работа",Работа);
	ИтоговаяСумма = 0;
	
	ТабДок.НачатьАвтогруппировкуСтрок();
	ВыборкаГод = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаГод.Следующий() цикл
		СтрокаДаты = Строка(ВыборкаГод.ПериодГод);
		СтрокаЗамены = СтрЗаменить(СтрокаДаты,Символы.НПП,"");
		ОбластьГод.Параметры.ПериодГод = СтрокаЗамены+" год";
		ОбластьГод.Параметры.Сумма = ВыборкаГод.ОплаченнаяСумма;
		ВыборкаМесяц = ВыборкаГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТабДок.Вывести(ОбластьГод,ВыборкаГод.Уровень());
		Пока ВыборкаМесяц.Следующий() цикл
			ОбластьМесяц.параметры.Заполнить(ВыборкаМесяц);
			ВыборкаСтрока = ВыборкаМесяц.Выбрать();
			
			ТабДок.Вывести(ОбластьМесяц,ВыборкаМесяц.Уровень());
			Пока ВыборкаСтрока.Следующий() цикл
				ОбластьСтрока.параметры.Заполнить(ВыборкаСтрока);
				ИтоговаяСумма = ИтоговаяСумма + ВыборкаСтрока.ОплаченнаяСумма;
				ТабДок.Вывести(ОбластьСтрока,ВыборкаСтрока.Уровень());
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ОбластьИтог.Параметры.ИтоговаяСумма = ИтоговаяСумма;
	ТабДок.Вывести(ОбластьИтог);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
